In [149]:
import pandas as pd
import numpy as np
data = pd.read_csv('titanic.csv',index_col='PassengerId')

In [150]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [163]:
all_pass = data['Survived'].count()
survived = data['Survived'].sum()
per_surv = ((survived * 100)/all_pass)
print ("%.1f" % per_surv)

38.4

In [156]:
age_avrg = np.mean(data['Age'])
print("%.2f" % age_avrg)

29.70

In [159]:
sort_age = data['Age'].sort_values()
sort_age

PassengerId
804    0.42
756    0.67
645    0.75
470    0.75
79     0.83
       ...
860     NaN
864     NaN
869     NaN
879     NaN
889     NaN
Name: Age, dtype: float64

In [164]:
age_median = sort_age.median()
age_median

28.0

In [167]:
print(data['Sex'].value_counts())

male      577
female    314
Name: Sex, dtype: int64

In [174]:
sort_pclass = data['Pclass'].value_counts().sort_index()
sort_pclass

1    216
2    184
3    491
Name: Pclass, dtype: int64

In [177]:
mas = np.array(sort_pclass)
mas

array([216, 184, 491], dtype=int64)

In [184]:
f_class = ((216*100)/891)
f_class

24.242424242424242

In [201]:
print(data['SibSp'].corr(data['Parch']))

0.41483769862

In [216]:
sort_sex = data.loc[data['Sex'] == 'female']
sort_sex

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25,0,1,230433,26.0000,NaN,S
883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22,0,0,7552,10.5167,NaN,S
886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39,0,5,382652,29.1250,NaN,Q
888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [226]:
snames = sort_sex['Name']
snames

PassengerId
2      Cumings, Mrs. John Bradley (Florence Briggs Th...
3                                 Heikkinen, Miss. Laina
4           Futrelle, Mrs. Jacques Heath (Lily May Peel)
9      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10                   Nasser, Mrs. Nicholas (Adele Achem)
                             ...
881         Shelley, Mrs. William (Imanita Parrish Hall)
883                         Dahlberg, Miss. Gerda Ulrika
886                 Rice, Mrs. William (Margaret Norton)
888                         Graham, Miss. Margaret Edith
889             Johnston, Miss. Catherine Helen "Carrie"
Name: Name, dtype: object